# SolidCurveIntersectionOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SolidCurveIntersectionOptions Members
SolidCurveIntersectionOptions Class Constructors Methods Properties See Also
---
The SolidCurveIntersectionOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SolidCurveIntersectionOptions | Constructs a new SolidCurveIntersectionMode with default settings. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the SolidCurveIntersectionOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ResultType | The type of results expected by the calculation. The default is CurveSegmentsInside. |

# See Also
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace